## Plan Result (dev_frontdoor)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 13 to add, 4 to change, 4 to destroy.</code></pre>

* Create
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;darts-portal&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;jd-bureau&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;jd-public&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;portal-dev&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;toffee&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;vh-admin-web&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;vh-test-web&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;vh-video-web&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;vh-video-web-reform&#34;]
* Update
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;darts-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;darts-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;darts-portal&#34;]
  * module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]
* Replace
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;darts-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;darts-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;darts-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;darts-portal&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["darts-portal"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      ~ expiration_date          = "0001-01-01T00:00:00.0000000" -> (known after apply)
      ~ host_name                = "darts-portal.dev.platform.hmcts.net" -> "darts.dev.platform.hmcts.net" # forces replacement
      ~ id                       = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/customDomains/darts-portal" -> (known after apply)
        name                     = "darts-portal"
      + validation_token         = (known after apply)
        # (1 unchanged attribute hidden)

      ~ tls {
          ~ cdn_frontdoor_secret_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/secrets/46bf4e26-b006-473c-a3e8-f5962b672b98-darts-portal-dev-platform-hmcts-net" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["darts-portal"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_A" {
      ~ cdn_frontdoor_custom_domain_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/customDomains/darts-portal" # forces replacement -> (known after apply) # forces replacement
      ~ id                             = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/associations/darts-portal" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B["darts-portal"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_B" {
      ~ cdn_frontdoor_custom_domain_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/customDomains/darts-portal" # forces replacement -> (known after apply) # forces replacement
      ~ id                             = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/associations/darts-portal" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin["darts-portal"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_origin" "front_door_origin" {
        id                             = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/originGroups/darts-portal/origins/darts-portal"
        name                           = "darts-portal"
      ~ origin_host_header             = "darts-portal.dev.platform.hmcts.net" -> "darts.dev.platform.hmcts.net"
        # (9 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["darts-portal"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_custom_domain_ids = [
          - "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/customDomains/darts-portal",
        ] -> (known after apply)
        id                              = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/afdEndpoints/sdshmcts-dev/routes/darts-portal"
        name                            = "darts-portal"
        # (10 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B["darts-portal"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_B" {
      ~ cdn_frontdoor_custom_domain_ids = [
          - "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/customDomains/darts-portal",
        ] -> (known after apply)
        id                              = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/afdEndpoints/sdshmcts-dev/routes/darts-portalHttpsRedirect"
        name                            = "darts-portalHttpsRedirect"
        # (10 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy["darts-portal"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      ~ id                       = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/securityPolicies/dartsportaldevPremium-securityPolicy" -> (known after apply)
        name                     = "dartsportaldevPremium-securityPolicy"
        # (1 unchanged attribute hidden)

      ~ security_policies {
          ~ firewall {
                # (1 unchanged attribute hidden)

              ~ association {
                    # (1 unchanged attribute hidden)

                  ~ domain {
                      ~ active                  = true -> (known after apply)
                      ~ cdn_frontdoor_domain_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/customDomains/darts-portal" # forces replacement -> (known after apply) # forces replacement
                    }
                }
            }
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["darts-portal"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.darts"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "dev.platform.hmcts.net"

      + record {
          + value = (known after apply)
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["jd-bureau"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.jdbureau"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "dev.platform.hmcts.net"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["jd-public"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.jdfrontend"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "dev.platform.hmcts.net"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["portal-dev"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.portal-dev"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "pre-recorded-evidence.justice.gov.uk"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["toffee"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.toffee"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "dev.platform.hmcts.net"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["vh-admin-web"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.vh-admin-web"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "dev.platform.hmcts.net"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["vh-test-web"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.vh-test-web"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "dev.platform.hmcts.net"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["vh-video-web"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.vh-video-web"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "dev.platform.hmcts.net"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["vh-video-web-reform"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.vh-video-web-dev"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hearings.reform.hmcts.net"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
        id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev|fd-log-analytics-logs-sa"
        name               = "fd-log-analytics-logs-sa"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 13 to add, 4 to change, 4 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":626,"Program":"tfcmt","SHA1":"","Target":"dev_frontdoor","Vars":{}} -->